// created by px13r
// These service accounts shouldn't be used for logging onto systems.
DeviceLogonEvents
| where AccountName in~ ("SERVICE", "ACCOUNT", "NAMES")
| project AccountName, DeviceName, Timestamp, RemoteIP, DeviceId, ReportId
